Repository: Jodsderechte/Jodsderechte.github.io
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de_de

# RivalsstatsDesc
source: RivalsStats is a web-based analytics platform that consolidates historical performance data on characters, rankings, and team compositions. Using statistical models and interactive dashboards, it turns complex metrics into intuitive, actionable insights, empowering users to make informed decisions.
de_de: RivalsStats ist eine webbasierte Analyseplattform, die historische Leistungsdaten zu Figuren, Ranglisten und Teamzusammenstellungen konsolidiert. Mithilfe statistischer Modelle und interaktiver Dashboards werden komplexe Spielmetriken in intuitive, umsetzbare Erkenntnisse verwandelt, damit Nutzer fundierte Entscheidungen treffen können.

# WACreatorDesc
source: WeakAurasCreator is a web application that empowers users to design, simulate, and generate custom real-time alert widgets through an intuitive wizard interface. By abstracting complex scripting and simulation logic into simple form inputs, it delivers ready-to-use snippets for seamless integration into interactive environments.
de_de: WeakAurasCreator ist eine Web-Anwendung, mit der Nutzer über eine intuitive Oberfläche benutzerdefinierte Echtzeit-Benachrichtigungs-Widgets entwerfen und generieren können. Komplexe Skript-Logik wird in einfache Formularfelder überführt und es werden gebrauchsfertige Snippets erstellt, die nahtlos in interaktive Umgebungen integriert werden können.

source: Contact
de_de: Kontakt

# ContactText
source: Get in Contact with me
de_de: Fragen? Hier das Kontaktformular

# LinkedInLink
source: Contact me through Linkedin
de_de: Kontakt über Linkedin

# DiscordLink
source: Contact me through Discord
de_de: Kontakt über Discord

# AdditionalCoursesDesc
source: In addition to the required lectures I also took the following courses.
de_de: Zusätzlich zu den Pflichtkursen meines Studiums belegte ich erfolgreich folgende Vertiefungsfäche.

# ComputerVisionDesc
source: The students understand the process of image creation by digital cameras and are able to perform camera calibration. They are capable of selecting and applying suitable algorithms to improve image quality. They are familiar with methods for pattern recognition in images and can apply them. They have developed an understanding of both classical and AI-based image segmentation and can select and use appropriate methods to solve concrete computer vision problems.
de_de: Zertifikat: Die Studierenden verstehen den Vorgang der Bilderzeugung durch Digitalkameras und können eine Kamerakalibrierung durchführen. Sie sind in der Lage geeignete Algorithmen zur Verbesserung der Bildqualität auszuwählen und anzuwenden. Sie kennen Verfahren zur Mustererkennung in Bildern und können diese anwenden. Sie haben ein Verständnis für klassische und KI-basierte Bildsegmentierung erarbeitet und können passende Verfahren auswählen und benutzen, um konkrete Computer Vision Probleme zu lösen.

# FTCG
source: Advanced Topics in Computer Graphics
de_de: Fortgeschrittene Themen der Computergrafik

# FTCGDesc
source: The participants are familiar with advanced techniques in computer graphics and understand how to implement the presented theory in software.They know the theoretical and mathematical foundations of global illumination—particularly the rendering equation—and can translate this theory into software.The participants understand the basics of implementing a Monte Carlo ray tracer and solving the rendering equation using techniques such as photon mapping, and they can realize these techniques in code using programming languages like Java.They know the application domains of the theory covered and can apply the knowledge in practice.The participants are aware of the state of the art and are able to follow original research publications.
de_de: Zertifikat: Die Teilnehmenden kennen fortgeschrittene Techniken der Computergrafik und verstehen die Software-Umsetzung der dargestellten Theorie. Sie kennen die theoretischen und mathematischen Grundlagen der globaler Beleuchtung, insbesondere die Rendering Equation und können diese Theorie in Software umsetzen.Die Teilnehmenden kennen die Grundlagen der Implementierung eines Monte-Carlo Ray-Tracers und die Lösung der Rendering Equation mit Hilfe von Techniken wie Photon-Mapping und können diese mit Hilfe von Programmiersprachen wie Java in Software umsetzen.Sie kennen die Anwendungsgebiete der betrachteten Theorie und können das vermittelte Wissen in die Praxis umsetzen.Die Teilnehmer kennen den State-of-the-Art und können Originalveröffentlichungen nachvollziehen.

# SSEDesc
source: Assessment of the importance of attack-proof software.Knowledge of the most important classes of software security vulnerabilities.Methods for considering security objectives and avoiding security vulnerabilities in all phases of the software development process (from requirements gathering to quality assurance).
de_de: Ziel der Veranstaltung ist es, dass die Teilnehmenden ein fundiertes Verständnis der wichtigsten Aspekte des angriffssicheren Software-/Systementwurfs erhalten und diese in der Praxis auf die unterschiedlichsten Systeme übertragen können.Die Lerninhalte der Vorlesung decken den kompletten Lebenszyklus von Systemen ab und umfassen unter anderem die interaktive Vermittlung von Schwachstellen, das Identifizieren und Modellieren von Bedrohungen, die Anwendung von Architekturprinzipien sowie die zielgerichtete Anwendung der Verifikation.

# FUI
source: UI Frameworks
de_de: Frameworkbasierte UI-Entwicklung

# FUIDesc
source: The students understand the basics and concepts of the development of modern graphical user interfaces, in theory and using modern architectures and frameworks.They have used frameworks to develop to develop examples.The students are able to read research papers and can use this knowledge in their own projects.
de_de: Die Teilnehmer verstehen wichtige Grundlagen und Konzepte zur Entwicklung von modernen Benutzerschnittstellen.Neben theoretischem Wissen sind den Teilnehmern aktuelle Architekturen und Frameworks zur Erstellung von Benutzerschnittstellen bekannt.Anhand von ausgewählten Beispielen sollen Sie geeignete Frameworks grundlegend praktisch angewandt haben.Nach Teilnahme an den Modulveranstaltungen sollen die Teilnehmer in der Lage sein, in diesem Gebiet aktuelle Themen zu recherchieren, zu analysieren und eigene knappe, wissenschaftlich geprägte Artikel zu verfassen beziehungsweise ihr erworbenes Wissen praktisch anzuwenden.

# Philo
source: Philosophy for Computer Scientists and Engineers
de_de: Philosophie für Informatiker und Ingenieure

# VDADesc
source: This course focused on the visualization of data, and how to effectively communicate information through the use of visual representations.The course covered the fundamentals of data visualization, including the use of color, typography, and layout.The course also covered the use of various tools for data visualization in R, including ggplot and plotly.
de_de: Der Kurs konzentrierte sich auf die Visualisierung von Daten und die effektive Kommunikation von Informationen durch den Einsatz visueller Darstellungen.Die Grundlagen der Datenvisualisierung, einschließlich des Einsatzes von Farbe, Typografie und Layout wurden vermittelt.Darüber hinaus wurden verschiedene Tools für die Datenvisualisierung in der Programmiersprache R behandelt; darunter ggplot und plotly.

# EAE
source: App Development
de_de: Einführung in die App-Enwicklung

# EAEDesc
source: This course focused on the App-Development in the Android universe.The course covered the fundamentals of Android development, including the use of Android Studio, Java, and XML.The course also covered the use of various tools for Android development, including the Android SDK and the Android Emulator.
de_de: Beschreibung der Veranstaltung:Ziel ist es, Studierenden die Grundlagen in der Entwicklung von mobilen Applikationen näher zu bringen.Durch die Teilnahme an den Veranstaltungen sind die Studierenden in der Lage, eigenständig einfache Applikationen für Smartphones zu realisieren.Sie verstehen die Architektur und haben Hintergrundwissen über das Betriebssystem Android.Sie kennen und verstehen Methoden und Konzepte zur Entwicklung von Apps für Android und können diese auch anwenden.Sie beherrschen verschiedene Entwicklungswerkzeuge. Die Auszeichnungssprache XML ist ihnen grundlegend bekannt.

# NPROG
source: Concurrent Programming with Java: Concepts and Applications
de_de: Nebenläufige Programmierung: Konzepte und Anwendungen

# NPROGDesc
source: Course participants are acquainted with the relevance and most important concepts of concurrent programming.They are familiar with the different types of synchronization, in addition to their use in algorithms and their conception in data structures.The most important design archetypes for concurrency are well-known to the participants; they can carry out assessments of runtime performance and can implement simple algorithms and data structures.Thus, participants are acquainted with a variety of methods on how concepts are implemented in practice.
de_de: Zertifikat:Teilnehmende kennen die Bedeutung und wichtigsten Konzepte der nebenläufigen Programmierung.Sie erlernten die unterschiedlichen Synchronisierungsarten und deren Verwendung bei Algorithmen und den Entwurf von Datenstrukturen.Die wichtigsten Entwurfsmuster für Nebenläufigkeit sind bekannt - einfache Abschätzungen für Laufzeitverhalten können durchgeführt und einfache Algorithmen und Datenstrukturen umgesetzt werden.Die Teilnehmenden kennen die wichtigsten Software-Pakete, die in der Praxis eingesetzt werden, und können mit diesen Werkzeugen eigene Anwendungen erstellen.

# CryptoDesc
source: Participants will understand the principles of Bitcoin and Blockchain, learn about mathematical and economic models, protocols, and algorithms.They are familiar with the cryptocurrencies including Bitcoin or Ethereum, understand how the Blockchain works as a distributed ledger, comprehend the principles and significance of decentralized consensus protocols and will be able to decide when to use these technologies.Participants will explore the economy of cryptocurrencies, and learn about prices, exchanges and wallets.They will identify applications and best investment practices as well as use cases in different industries.
de_de: Beschreibung der Veranstaltung:Teilnehmende verstehen die Prinzipien von Bitcoin und Blockchain, erlernten die mathematischen Modelle, Protokolle und Algorithmen.Sie sind vertraut mit Kryptowährungen, wie Bitcoin und Ethereum, verstehen, wie die Blockchain als Distributed Ledger funktioniert, und begreifen die Prinzipien und Signifikanz dezentralisierter Konsensus- Protokolle, um zu entscheiden, wann diese Technologien optimal eingesetzt werden können.Teilnehmende erforschten die Ökonomie der Währungen und lernten Preismodelle, Börsen und Wallets kennen.Sie kennen die entsprechenden White Papers, technischen Artikel und die Spezifikationen der Protokolle, um diese entsprechend zu verstehen und einzusetzen.Weiter sind sie in der Lage, Anwendungsszenarien, Investmentpraktiken und Einsatzgebiete in unterschiedlichen Industrien zu identifizieren.

source: Additional Courses
de_de: Vertiefungsfächer

source: Course Information
de_de: Kursinformation

source: Learning Method
de_de: Lernmethode

# LectureIntegratedPractice
source: Lecture with integrated Practice
de_de: Vorlesung mit Praxisanteil

# examForm
source: Form of Exam
de_de: Prüfungsform

source: Oral
de_de: Mündlich

source: Workload
de_de: Arbeitsaufwand

source: Attendance
de_de: Präsenzzeit

source: Self Study
de_de: Selbststudium

source: Practical
de_de: Praktisch

source: Project
de_de: Projekt

source: Lecture
de_de: Vorlesung

source: Presentation
de_de: Präsentation

source: Seminar Paper
de_de: Seminararbeit

# Block
source: Blocked Lecture
de_de: Geblockte Vorlesung

source: Practical Exam
de_de: Praktische Klausur

source: hours
de_de: Stunden

source: Content
de_de: Inhalt

source: Grade
de_de: Note

# project
source: Graded Project
de_de: Benotetes Projekt

# FTCGProject
source: Creation of a Raytracer
de_de: Erstellung eines Raytracers

# SSEProject
source: Generative AI: Large Language Models in Software-Development und Software-Security
de_de: Generative KI: Large Language Models in Softwareentwicklung und Softwaresicherheit

# FUIProject
source: New things from the FAIRD
de_de: Neues vom FAIRD

# VDAProject
source: Analysis: Videogame Sales
de_de: Analyse: Videospiel Verkäufe

# EAEProject
source: CRUD: Bookshelf-App
de_de: CRUD: Buchregal-App

# VDAProjectDesc
source: Following theses or research questions were analyzed: - In which years were the most games released and sold? - How do release and sales figures differ between 1980 and today? - Which were the best sales years in terms of number of sales per game? Are newer games bought more frequently? - Which platform has the best sales figures? Which one has the most releases? - Do established, older platforms have a larger game library and more sales than platforms that are newly launched? - Are there regional differences in user behavior for platforms? Do regional platforms regularly sell more games? - How do sales per platform develop over the years? Does the biggest "hype" with the highest sales occur shortly after release? - Are there concentrations in the number of games and sales among certain publishers (e.g., Nintendo, EA, Activision Blizzard)? - Are there regional differences in user behavior for publishers? Are regional publishers favored? - What is the distribution of game genres? Are there concentrations of certain genres in terms of number and sales figures? Which genres have the best/worst sales figures? - Are there regional differences among genres? (Are there regional differences in user or consumption behavior for specific genres?) - How have the genres evolved over the years? - Are there genres that, after high initial interest, have now become insignificant? - Are there publishers that preferentially offer certain genres and/or publishers that record high sales figures for games of a particular genre?
de_de: Folgende Thesen bzw. Fragestellungen wurden analysiert: - In welchen Jahren wurden die meisten Spiele veröffentlicht und verkauft? - Wie unterscheiden sich die Veröffentlichungs- und Verkaufszahlen zwischen 1980 und heute? - Welches waren die besten Verkaufsjahre bezogen auf die Zahl der Verkäufe pro Spiel? Werden die jeweils neueren Spiele dabei häufiger gekauft? - Welche Plattform hat die besten Verkaufszahlen? Welche die meisten Releases? - Haben etablierte, ältere Plattformen ein größeres Spielangebot und mehr Verkäufe als Plattformen, die neu auf den Markt kommen? - Gibt es regionale Unterschiede im Nutzerverhalten bei Plattformen? Verkaufen die regionalen Plattformen regelmäßig auch mehr Spiele? - Wie entwickeln sich die Verkäufe pro Platform im laufe der Jahre? Entsteht bei Verkäufen kurz nach dem Release jeweils der größte “Hype” mit den höchsten Verkaufszahlen? - Gibt es Häufungen bei der Zahl der Spiele und der Verkäufe bei bestimmten Publisher (z.B. Nintendo, EA, Activision Blizzard)? - Gibt es regionale Unterschiede im Nutzerverhalten bei Publishern? Werden regionale Publisher favoritisiert? - Wie ist die Verteilung der Genres der Spiele? Gibt es Häufungen bestimmter Genres bei Zahl und Verkaufszahlen? Welche Genres haben die besten/schlechtesten Verkaufszahlen? - Gibt es regionale Unterschiede bei den Genres? (Gibt es regionale Unterschiede im Nutzer- oder Konsumverhalten bei spezifischen Genres?) - Wie haben sich die Genres über die Jahre entwickelt? - Gibt es Genres, die nach großem Interesse nun bedeutungslos sind? - Gibt es Publisher, die bestimmte Genres bevorzugt anbieten, und/oder Publisher, die hohe Verkaufszahlen von Games eines bestimmten Genres verzeichnen?

# FTCGProjectDesc
source: In the course, a Raytracer was designed and implemented from scratch. Afterwards it was extended by adding the ability to read in completed .obj files and render those.
de_de: Im Verlauf des Kurses wurde ein Raytracer von Grund auf entworfen und implementiert. Anschließend wurde er um die Fähigkeit erweitert, fertige .obj-Dateien einzulesen und zu rendern.

# EAEProjectDesc
source: In the course, a CRUD (Create, Read, Update, Delete) App was designed. This app allows users to add books to a list and mark them as read. It leverages the open library api to let users search for books by title and Author and loads in data like the cover to display.
de_de: Im Rahmen des Kurses wurde eine CRUD-App (Create, Read, Update, Delete) entwickelt. Diese App ermöglicht es Nutzenden, Bücher zu einer Liste hinzuzufügen und sie als gelesen zu markieren. Sie nutzt die Open Library API, um nach Büchern anhand von Titel und Autor zu suchen, und lädt Daten wie das Cover, um diese anzuzeigen.

# CryptoProjectDesc
source: The final Project of the course was testing the feasability and creating a Riester complaicent Crypto ETF. The final result was a fully fledged out ETF realised as a Wikifolio (an online page that let's anyone create ETF like portfolios others can follow).
de_de: Das Abschlussprojekt des Kurses bestand darin, die Machbarkeit eines Riester-konformen Crypto-ETFs zu prüfen und zu realisieren. Das Endergebnis war ein vollwertiger ETF, umgesetzt als Wikifolio (eine Online-Plattform, auf der jeder ETF-ähnliche Portfolios erstellen und von anderen folgen lassen kann).

source: Show Details
de_de: Details anzeigen

# ScrollToTop
source: Scroll to the Top
de_de: Zurück nach oben

source: Credits
de_de: Anerkennungen

source: Course images designed by
de_de: Kurs Bilder designt von

# ApplicantIconsCreatedByProsymbolsPremium
source: Favicon created by Prosymbols Premium
de_de: Favicon erstellt von Prosymbols Premium

# creditsDescription
source: For the creation of this page some free resources were used. Namingly these include the following:
de_de: Für die Erstellung dieser Webseite wurden einige kostenlose Resourcen verwendet. Namentlich sind dies die Folgenden:

source: Website Template
de_de: Webseiten-Vorlage

# HomeImage
source: Home Image by
de_de: Übersicht Bild von

source: Imprint
de_de: Impressum

# changelog
source: Changelog of the latest Version
de_de: Änderungsprotokoll der letzten Version

source: Go Home
de_de: Zurück

# wrongTurn
source: Looks like you took a wrong turn
de_de: Falsche Ausfahrt benutzt?

source: Page Not Found
de_de: Seite nicht gefunden

# 404Page
source: 404 Page Design by
de_de: 404 Seiten-Design von

# YourMessageSent
source: Your message has been sent. Thank you!
de_de: Die Nachricht wurde gesendet. Vielen Dank!

source: Send Message
de_de: Nachricht senden

source: Message
de_de: Nachricht

source: Subject
de_de: Betreff

source: Your Email
de_de: Mail

source: Your Name
de_de: Name

source: Loading
de_de: Laden...

# StatsDescription
source: Over the Years I've created a lot of different Projects. A couple of stats from my public projects can be found below.
de_de: Im Laufe der Jahre habe ich viele verschiedene Projekte erstellt. Einige Daten zu meinen öffentlichen Projekten finden sich unten.

source: Image By
de_de: Bild bereitgestellt von
