Repository: Jodsderechte/Jodsderechte.github.io
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: de_de

# weekday.Monday
source: Monday
de_de: Montag

# weekday.Tuesday
source: Tuesday
de_de: Dienstag

# weekday.Wednesday
source: Wednesday
de_de: Mittwoch

# weekday.Thursday
source: Thursday
de_de: Donnerstag

# weekday.Friday
source: Friday
de_de: Freitag

# weekday.Saturday
source: Saturday
de_de: Samstag

# weekday.Sunday
source: Sunday
de_de: Sonntag

# month.January
source: January
de_de: Januar

# month.February
source: February
de_de: Februar

# month.March
source: March
de_de: März

# month.May
source: May
de_de: Mai

# month.June
source: June
de_de: Juni

# month.July
source: July
de_de: Juli

# month.October
source: October
de_de: Oktober

# month.December
source: December
de_de: Dezember

source: the
de_de: den

# SkillsDescription
source: During my studies and in my leisure time, I delved into various programming languages and other relevant topics in software development. I gained proficiency in languages such as Lua and Java. Allowing me to implement diverse algorithms and develop applications with different functionalities. Additionally, I explored web development, learned HTML, CSS, and JavaScript to create interactive and visually appealing websites. <br> <br> Moreover, I familiarized myself with essential tools like Git, enabling version control and collaborative coding. This taught me the importance of teamwork in software projects and the significance of maintaining a well-organized and efficient codebase. Alongside version control, I also honed my skills in SQL, grasping the fundamentals of database design and management. Understanding SQL has been vital in building dynamic applications that interact with databases to store and retrieve information. <br> <br> Overall, my passion for programming drove me to continuously expand my knowledge in the field. Formal education and self-directed learning built a strong foundation in various programming languages and relevant tools, empowering me to tackle complex software projects and contribute effectively to the world of technology. A selection of these skills can be found below.
de_de: Während meines Studiums und in meiner Freizeit habe ich mich intensiv mit verschiedenen Programmiersprachen und anderen relevanten Themen im Bereich der Softwareentwicklung beschäftigt. So habe ich Kenntnisse in Sprachen wie Lua und Java, die es mir ermöglichen, diverse Algorithmen zu implementieren und Anwendungen mit unterschiedlichen Funktionalitäten zu entwickeln. Darüber hinaus habe ich HTML, CSS und JavaScript erlernt, um interaktive und visuell ansprechende Websites zu erstellen. <br><br> Zusätzlich habe ich mich mit grundlegenden Werkzeugen wie Git vertraut gemacht, um Versionskontrolle und gemeinsame Programmierung durchzuführen. Die dabei gemachten Erfahrungen haben mir die Bedeutung von Teamarbeit in Softwareprojekten und die Wichtigkeit eines gut organisierten und effizienten Codebestands verdeutlicht. Neben der Versionskontrolle nutze ich meine vertieften Kenntnisse in SQL zum Verständnis der Grundlagen von Datenbankdesign und -verwaltung. Damit ist es mir möglich, dynamische Anwendungen zu entwickeln, die mit Datenbanken interagieren, um Informationen zu speichern und abzurufen. <br><br> Insgesamt hat mich meine Leidenschaft für das Programmieren dazu motiviert, mein Wissen in diesem Bereich kontinuierlich zu erweitern. Durch eine formale Ausbildung und eigenständiges Lernen habe ich mir eine solide Grundlage in verschiedenen Programmiersprachen und relevanten Werkzeugen geschaffen, die es mir ermöglichen, komplexe Softwareprojekte anzugehen und eigene Beiträge zu entwickeln. Ein kurzer Überblick:

source: Skills
de_de: Fähigkeiten

source: Technology
de_de: Technologien

source: Home
de_de: Übersicht

source: About
de_de: Auf einen Blick

source: Resume
de_de: Lebenslauf

source: Services
de_de: Angebote

# Installs
source: Users
de_de: Nutzende

source: Positive Reviews
de_de: Positive Bewertungen

source: Answered Comments
de_de: Beantwortete Kommentare

# JoinedGitHubYearsAgo
source: Joined GitHub {years} years ago
de_de: Seit {years} Jahren Teil von Github

# CreatedGitHubRepositories
source: Created {amount} Repositories
de_de: Hat {amount} Repositories erstellt

# GitHubFollowedBy
source: Followed by {amount} People
de_de: Gefolgt von {amount} Personen

source: Recent Contributions
de_de: Neueste Aktivität

source: I'm a
de_de: Ich bin ein

# ImATexts
source: Tooling
de_de: Master-Student, Software-Entwickler, Modder, Addon-Entwickler, Gamer

source: Other
de_de: Sonstiges

source: Video Editing
de_de: Video-Bearbeitung

# Hochschule Kaiserslautern
source: University of Applied Science Kaiserslautern
de_de: Hochschule Kaiserslautern

source: Software Development
de_de: Software-Entwicklung

source: Applied Informatics
de_de: Angewandte Informatik

# Fachoberschule Nierstein
source: Technical secondary school Nierstein
de_de: Fachoberschule Nierstein

source: Technical diploma
de_de: Fach-Abitur

source: Intern
de_de: Praktikant

source: Quality Assurance
de_de: Qualitätssicherung

source: Now
de_de: Jetzt

source: Wiesbaden, Hesse, Germany
de_de: Wiesbaden, Hessen, Deutschland

source: Creating UI improvements for the Videogame World of Warcraft using LUA
de_de: Erstellung von UI-Verbesserungen für das Videospiel World of Warcraft mithilfe von LUA

source: Creating Webapps for the Videogame World of Warcraft
de_de: Erstellung von Webapps für das Videospiel World of Warcraft

source: Creating Modifications for the Videogame Ark using Unreal Engine
de_de: Erstellung von Modifikationen für das Videospiel Ark mithilfe von Unreal Engine

source: Bachelor Thesis Software Development
de_de: Bachelorarbeit im Bereich Software-Entwicklung

source: Kaiserslautern, Rhineland-Palatinate, Germany
de_de: Kaiserslautern, Rheinland-Pfalz, Deutschland

source: Implementation of a configuration interface for creating dashboard widgets in Servity.
de_de: Umsetzung einer Konfigurationsoberfläche für die Erstellung von Dashboard-Widgets in Servity.

source: Student Internship
de_de: Praxissemester

source: Evaluation and prototyping of a configuration interface for creating dashboard widgets in Servity.
de_de: Evaluation und Erstellung eines Prototyps einer Konfigurationsoberfläche zur Erstellung von Dashboard-Widgets in Servity.

source: Student Assistant
de_de: Hilfswissenschaftler (HiWi)

source: Student Assistant for Ui/Ux development for N-soria/shift
de_de: Hiwi für Ui-/Ux-Entwicklung für N-soria/shift

# ResumeGatheringExplanation
source: The Resume Information is automatically gathered from Linked and was last updated {timestamp}.
de_de: Die Lebenslauf-Informationen werden automatisch von Linkedin importiert und wurden zuletzt {timestamp} geupdated.

# CreatedGitHubCommits
source: Created {amount} Commits.
de_de: {amount} erstellte Commits.

# MergedPullRequests
source: Merged {amount} pull requests.
de_de: {amount} gemergte Pull-Requests.

# CreatedReleases
source: Created {amount} releases.
de_de: {amount} erstellte Releases.

# PreferredLicense
source: Preferred License: {license}.
de_de: Bevorzugte Lizenz: {license}

source: Education
de_de: Ausbildung

source: Professional Experience
de_de: Berufserfahrung

source: Learn More
de_de: Mehr hier

# UnrealEngineWorkshopLinkText
source: Link to the Workshop
de_de: Link zu dem Workshop

# UnrealEngineDesc
source: I used Unreal Engine for multiple Ark mods as well as some standalone Game Projects. Additionally for a University project I added a Voice controlled LLM based NPC with an Unreal Project. I've even created an Interactive Workshop teaching the basics of Unreal Engine.
de_de: Ich habe „Unreal Engine“ bereits für mehrere „Ark Mods“ sowie einige standalone Game-Projekte genutzt. Desweiteren konnte ich im Rahmen eines Hochschulprojekts eine sprachgesteuerte, LLM-basierte NPC in ein Unreal-Projekt einbinden. Ich habe als Studienarbeit einen interaktiven Workshop erstellt, der die Grundlagen von „Unreal-Engine- Blueprints“ erläutert.

# SQLDesc
source: For my World of Warcraft Stat Displaying Website I used a MySQL database and had to write extensive queries to aggregate data for User Display.
de_de: Für die von mir erstellte World of Warcraft-Statistik-Webseite habe ich eine MySQL-Datenbank verwendet und extensive Queries erstellt, um die Daten für die Frontend-Anzeige zu aggregieren.

# SQLMythiStoneGitHubLinkText
source: Link to the Website Repo
de_de: Link zum Webseiten Repository

# AndroidDesc
source: For one of my lectures I wrote a simple CRUD Bookshelf App. Due to my food Intolerance I wrote a useful Android App which allows users to scan barcodes of food to warn them whether it is safe consume.
de_de: Im Rahmen eines Hochschulprojekts habe ich eine einfache Bücherregal-CRUD-App (Create Read Update Delete) erstellt. Nachdem bei mir eine Lebensmittelunverträglichkeit diagnostiziert wurde, habe ich - auch für andere Betroffene - eine einfach zu bedienende Android-App erstellt. Sie ermöglicht Nutzenden durch einfaches Scannen des Barcodes der Lebensmittelverpackungen, selbst mögliche Gefährdungen infolge von Unverträglichkeiten zu erkennen

# IngredientsTrafficLightGitHubLinkText
source: Link to the Intolerance App Repo
de_de: Link zum Repository der Lebensmittelunverträglichkeits-App

# BookshelfGitHubLinkText
source: Link to the CRUD Bookshelf App
de_de: Link zum Repository der Bücherregal-App

# UnityDesc
source: During my Student Assistant job and for my Student Project I employed unity to work on a Bicycle Simulator mainly working on Ui and Ux features.
de_de: Während meiner Tätigkeit als HiWi sowie für ein Studienprojekt habe ich Unity zur Entwicklung eines Fahradsimulators genutzt. Dabei habe ich hauptsächlich mit Ui-und Ux-Features gearbeitet.

# NsoriaUnityPlaylistLinkText
source: Link to some Trailer Videos
de_de: Link zu einigen Trailer-Videos des Fahrradsimulators

# TakeMeAlongLinkText
source: Link to the Webapp
de_de: Link zum Webapp-Repository

# JavaDesc
source: Java is the main language used for all Projects during my university Studies. Specifically for one of the Courses I used Java to create a Ride along Webapplication. In addition I used Java during my Student Internship and Bachelorthesis at DCON where I wrote the Backend and Frontend architecture for a configuraiton interface to create Dashboard widgets for their software Servity.
de_de: Java ist die primäre Programmiersprache, die ich während meines Studiums für alle Projekte verwendet habe. Insbesondere habe ich im Rahmen eines Kurses mit Java eine Mitfahr-Webanwendung erstellt. Darüber hinaus habe ich Java während meines Pflichtpraktikums und meiner Bachelorarbeit bei DCON eingesetzt, wo ich die Backend‑ und Frontend‑Architektur für eine Konfigurationsoberfläche zum Erstellen von Dashboard‑Widgets für deren Software Servity entwickelt habe.

# DiscordQueryBotLinkText
source: Link to the Bot Repository
de_de: Link zum Bot‑Repository

# CSharpDesc
source: During my Student Assistant job at the University of Applied Science I used Csharp in addition to Unity for the Work on a Bicycle Simulator. I used C# to create a Discord bot leveraging SteamA2S as well as gamedig to create Game Server status embeds.
de_de: Während meiner Tätigkeit als studentische Hilfskraft an der Hochschule habe ich neben Unity auch C# für die Arbeit am Fahrradsimulator verwendet. Zusätzlich habe ich mit C# einen Discord‑Bot entwickelt, der SteamA2S und gamedig nutzt, um Spielserver‑Status als Embeds anzuzeigen.

# CppLinkText
source: Link to the Course Information
de_de: Link zu den Kursinformationen

# CppDesc
source: One of the lectures during my studies were about usage of C++. 'Course participants are familiar with the C++ programming language and understand competent application of the language'. I leveraged C++ during the creation of the Network and Server Code for an Unreal Engine Game I’m creating with a friend.
de_de: Eine von mir erfolgreich absolvierte Vorlesung widmete sich dem Einsatz von C++ (»Die Kursteilnehmenden sind mit der Programmiersprache C++ vertraut und verstehen eine kompetente Anwendung der Sprache.«). <br> C++ wird von mir bei der Entwicklung des Netzwerk‑ und Servercodes für ein Unreal‑Engine‑Spiel eingesetzt, an dem ich gemeinsam mit einem Freund arbeite.

# CustomNamesLinkText
source: Link to the Repository for the Api Addon
de_de: Link zum Repository des API‑Addons

# RaidAbilityTimelineLinkText
source: Link to the Downlaod Page for the Timeline WeakAura
de_de: Link zur Download‑Seite für die Timeline‑WeakAura

# LuaDesc
source: I've been highly active in the World of Warcraft modding scene heavily relying on LUA. I wrote multiple Addons as well as creating WeakAuras, a framework used within the game to put customizable Graphics onto your screen. An example of Addons I’ve created is Custom Names. An api which allows users to Nickname eachothers ingame Personas to easily differentiate between eachother. One of the most popular WeakAuras I've creared is RaidAbilityTimeline which turns BossMod addon timers into a vertical stacked timeline.
de_de: Ich bin in der Modding‑Szene von World of Warcraft sehr aktiv. Dabei nutze ich LUA intensiv. Ich habe mehrere Add-ons geschrieben und WeakAuren, ein Framework, mit dem im Spiel anpassbare Grafiken angezeigt werden können, erstellt. Ein Beispiel für eines der von mir erstellten Add-ons ist CustomNames, eine API, mit der im Spiel die Ingame‑Namen zur einfacheren Identifizierung anderer angepasst werden können. Eine der beliebtesten WeakAuras, die ich erstellt habe, ist RaidAbilityTimeline, die Boss‑Mod‑Addon‑Timer in eine vertikale, animierte Zeitleiste umwandelt.

# JavaScriptDesc
source: I used Javascript during some Software-Engineering courses aswell as leavegering it to power the Webapps. One example is my Stat tracking Webpage which uses Javascript to allow for Client side search since Github Pages is a static hosting provider without being able to run Serverside code. In addition I gathered experience in Chart.js aswell as React during my Student Internship and Bachelorthesis for DCON.
de_de: In Software‑Engineering‑Kursen habe ich erfolgreich JavaScript eingesetzt und Webanwendungen damit erstellt. Ein Beispiel ist hier meine „World of Warcraft“-„Mythic Plus“-Statistik‑Webseite. Sie nutzt JavaScript für die clientseitige Suche, da GitHub-Pages ein statisches Hosting ist und ansonsten Serverside‑Codes nicht ausgeführt werden könnten. Während meines Praktikums und meiner Bachelorarbeit habe ich bei DCON Kaiserslautern, einem erfolgreichen Unternehmen im Enterprise Service Management, Erfahrungen mit Chart.js und React gesammelt.

# JavaScriptLinkText
source: Link to the Search tool on the Webpage
de_de: Link zum Such‑Tool auf der Webseite

# HTMLLinkText
source: Link to the Stat Tracking Webpage
de_de: Link zur Statistik‑Webseite

# HTMLDesc
source: I've used HTML to build the layout for the Webapps I've created. One example for this is my stat tracking website which uses Jinja2 Templates to built static HTML pages which are then deployed to the web. In addition the very text you are currently reading is powered by bootstrap and the same jinja workflow using i18n for localisation.
de_de: Zur Gestaltung des Layouts der von mir erstellten Web-Anwendungen habe ich HTML verwendet. Ein Beispiel hirrfür ist meine “World of Warcraft”-”Mythic Plus”-Statistik‑Webseite. Sie nutzt Jinja2‑Templates, um statische HTML‑Seiten zu erstellen, die dann bereitgestellt werden. Auch der Text dieser Seite wird von Bootstrap und dem Jinja‑Workflow mit i18n für die Lokalisierung bereitgestellt.

# CSSDesc
source: For the various Webapps I've created I used plain CSS aswell as Bootstrap for Styling. One such example is my Stat Tracking website aswell as this portfolio page you are currently on.
de_de: Für die verschiedenen Web-Anwendungen, die ich erstellt habe, habe ich einzig CSS sowie Bootstrap für das Styling verwendet. Ein Beispiel ist meine “World of Warcraft”-”Mythic Plus”-Statistik‑Webseite und diese Portfolioseite..

# CSSLinkText
source: Link to the Stat Tracking Webpage
de_de: Link zur Statistik‑Webseite

# MarkdownLinkText
source: Link to one example repository using markdown.
de_de: Link zu einem Beispiel‑Repository mit Markdown

# MarkdownDesc
source: Most of my public github repositories use YML to define Github Actions workflows, githubs Ci/CD pipeline. Aswell as Markdown for user facing descriptions.
de_de: Die meisten meiner öffentlichen GitHub‑Repositories verwenden YML zur Definition von GitHub-Actions-Workflows (GitHubs CI/CD‑Pipeline) sowie Markdown für nutzerseitige Beschreibungen.

# GithubLinkText
source: Link to my Github Page
de_de: Link zu meiner GitHub‑Seite

# GithubDesc
source: For Version control of my projects I use git. Most of those Projects are hosted on Github and are publicly viewable.
de_de: Für die Versionskontrolle meiner Projekte verwende ich jeweils Git. Die meisten dieser Projekte werden auf GitHub gehostet und sind öffentlich einsehbar.

# CICDDesc
source: My Projects use multiple CI&CD toolchains in order to power them. From fetching data over verifying code correctness and building static HTML pages to fully automated Releases.
de_de: Meine Projekte nutzen mehrere CI/CD‑Toolchains– vom Abrufen von Daten über die Überprüfung der Code-Korrektheit und den Bau statischer HTML‑Seiten bis hin zu vollautomatisierten Releases.

# CICDLinkText
source: Link to my Github Page
de_de: Link zu meiner GitHub‑Seite

# DockerLinkText
source: Link to my Dockerhub
de_de: Link zu meinem Docker Hub

# DockerDesc
source: During a bunch of University courses We used Docker to deploy various things like Databases and Webservers. In addition I created my own Docker images to run the server files for one of the Standalone Games I've created
de_de: Im Rahmen meines Computer-Visions-Kurses habe ich Python sowie TensorFlow verwendet, um Machine‑Learning‑Modelle zu trainieren. Außerdem habe ich Python für meine “World of Warcraft”-”Mythic Plus”- Statistik‑Webseite eingesetzt, sowohl für das Abrufen und Aggregieren von Daten als auch für die Erstellung statischer HTML‑Seiten mit Jinja2. Dieser Jinja2‑Workflow wird auch zum Erstellen und Bereitstellen dieser Portfolioseite verwendet.

# PythonLinkText
source: Link to the Stat Tracking Webapp
de_de: Link zur Stat‑Tracking‑Webapp

# PythonDesc
source: During my Computervision course I used python aswell as Tensorflow to train machine learning models. In addition I used python for my Stat tracking website where it was used in data fetching aggregation aswell as using jinja2 to built static html pages. The same jinja2 workflow is used to build and deploy this portfolio page.
de_de: Im Rahmen meines Computervisions‑Kurses habe ich Python sowie TensorFlow verwendet, um Machine‑Learning‑Modelle zu trainieren. Außerdem habe ich Python für meine World of Warcraft Mythic Plus Statistik‑Webseite eingesetzt, sowohl für das Abrufen und Aggregieren von Daten als auch für die Erstellung statischer HTML‑Seiten mit Jinja2. Dieser Jinja2‑Workflow wird auch zum Erstellen und Bereitstellen dieser Portfolioseite verwendet.

# RLinkText
source: Link to the online viewable analysis (in German)
de_de: Link zur online einsehbaren Analyse (auf Deutsch)

# RDesc
source: During the Visual Data analysis course I used R to analyse a Game Release Dataset. In addition I used R and specifically a RandomForest model during the Data Science course to predict NFL play success rate.
de_de: Link zum WeakAuras‑Tutorial

# MontageLinkText
source: Link to one of the Montages
de_de: Link zu einer der Montagen

# VideoEditingDesc
source: I've used Premiere Pro and After effects quite extensivly when producing content. For example I used it to create a Guide Video aswell as various Montages.
de_de: Ich habe Premiere Pro und After Effects umfangreich zur Content‑Produktion genutzt. Zum Beispiel habe ich damit sowohl Anleitungsvideos als auch verschiedene Highlightzusammenschnitte erstellt.

# AboutText
source: Hi, I'm Florian a {headline}. Nice to Meet You!
de_de: Hi, ich bin Florian ein {headline}. Freut mich dich kennenzulernen!

source: Gaming and Software development enthusiast
de_de: Videospiel- und Softwareentwicklungsenthusiast

source: Software Development Student and Gaming Enthusiast
de_de: Software-Entwicklungs Student und Gaming Enthusiast

source: Age
de_de: Alter

source: Location
de_de: Ort

source: Zweibrücken, Rhineland-Palatinate, Germany
de_de: Zweibrücken, Rheinland-Pfalz Deutschland

source: Degree
de_de: Abschluss

# DegreeValue
source: During my master's studies
de_de: Aktuell im Masterstudium

source: A simple lib adding the option for Name Variations to addons
de_de: Eine einfache Bibiliothek, die es erlaubt, Namensvariationen zu Addons hinzuzufügen.

source: Dynamic Weakauras creation tool for all the Dungeon needs
de_de: Ein Tool zur Erstellung dynamischer Dungeon-WeakAuras.

source: Adds Rio Score display to the GroupFinder frame
de_de: Fügt dem Gruppenfinder den Raider.io Score sowie weiter Informationen hinzu.

source: Adds the beloved automatic doors that we all got used to in AsE when using S+
de_de: Fügt die aus Ark Survivel Evolved beliebten automatischen Türen zu Ark Survival Ascended hinzu.

source: This mod can save your precious Dinos from certain Death
de_de: Diese Mod kann die Wertvollen Dinos vor dem Tod beschützen.

source: Adds ElvUI Tags for CustomNames.
de_de: Fügt ElvUI-Tags für CustomNames hinzu

source: Adds MRT support for CustomNames.
de_de: Fügt MRT-Support für CustomNames hinzu.

source: Adds Chat support for Customnames
de_de: Fügt Chat support für CustomNames hinzu.

source: Adds Guild support for Customnames
de_de: Fügt Gilden support für CustomNames hinzu.

source: Latest Version
de_de: Letzte Version

# dateModified
source: Last Release on:
de_de: Letztes Update

# descriptionExplanation
source: Description and Changelog are directly imported from the Project
de_de: Beschreibung und Änderungsprotokoll sind direkt vom Projekt importiert und daher nur in Englisch verfügbar.

source: Categories
de_de: Kategorien

# boss-encounters
source: Boss Encounter
de_de: Boss‑Begegnung

source: Buffs & Debuffs
de_de: Buffs und Debuffs

source: Miscellaneous
de_de: Sonstiges

source: Combat
de_de: Kampf

source: Chat & Communication
de_de: Chat und Kommunikation

source: Libraries
de_de: Bibliotheken

source: Unit-Frames
de_de: Einheiten‑Fenster

source: Guild
de_de: Gilde

source: Structures
de_de: Strukturen

source: General
de_de: Allgemein

source: Creatures
de_de: Kreaturen

source: Rebalancing
de_de: Neuausbalancierung

source: Views
de_de: Ansichten

source: Installs
de_de: Aktive Nutzer

# stars
source: Favorites
de_de: Positive Bewertungen

# commentCount
source: Comments
de_de: Kommentare

# ScrollDown
source: Find more
de_de: Mehr Infos

# PortfolioDesc
source: During my Studies I've spent a bunch of time on private projects mostly focusing on the Videogames World of Warcraft and Ark. A couple of my most popular can be found below.
de_de: Während meines Studiums habe ich viel Zeit in private Projekte investiert, die sich überwiegend auf die Videospiele “World of Warcraft” und “Ark” konzentrieren. Einige meiner beliebtesten Projekte finden sich unten.

source: Description
de_de: Beschreibung

# MythistoneDesc
source: Mythistone is a web platform that leverages statistical analysis to deliver personalized optimization recommendations. This helps users by transforming complex performance data into clear, actionable insights that guide users toward their goals.
de_de: Mythistone ist eine Webplattform, die statistische Analysen nutzt, um personalisierte Optimierungsempfehlungen zu liefern. Sie hilft Nutzenden, komplexe Leistungsdaten in klare, umsetzbare Erkenntnisse zu verwandeln und sie so auf dem Weg zu ihren Zielen zu unterstützen.
