{
  "DungeonAuraDescription":"Liefern wertvolle Informationen über die Umgebung, in der sich Spieler bewegen, und verbessern die Möglichkeit in anspruchsvollen Mythic+ Dungeons gut abzuschneiden",
  "ProgrammingLanguages":"Programmiersprachen",
  "ProgrammingLanguagesDescription":"Neben dem Studium,  das die Sprachen Java, C, C++, R JavaScript vermittelt, habe ich autodidaktisch Lua erlernt und in mehreren Projekten angewendet.",
  "GitDescription":"Täglich nutze ich GitHub als Hauptplattform zur Verwaltung und Freigabe meiner Projekte. Näheres:  <a href='https://github.com/Jodsderechte' target='_blank'>auf meinem GitHub-Profil</a>",
  "UnrealEngine": "Für private Projekte verwendete ich Unreal Engine, beispielhaft: <a href='https://store.epicgames.com/en-US/p/ark--modkit'>, die modifizierte Version von Unreal 4.5.1 </a> für meine <a href='#ArkMod'> ARK Survival Evolved MOD</a>, sowie Unreal 5.1 für ein eigenentwickeltes Survival-Spiel namen <a href='https://github.com/Jodsderechte/Ateria'target='_blank'>Ateria</a>",
  "Unity": "Zudem habe ich zuvor mit Unity gearbeitet an einem noch nicht veröffentlichten Fahrradsimulator für <a href='https://www.nsoria.io/' target='_blank'>Nsoria</a> namens Nsoria/Shift.",
  "RaidAbilityTimelineDescription":"Verwandelt die Timer der Boss Mod-Addons zur besseren Übersichtlichkeit in eine vertikale Zeitleiste.",
  "InterruptTrackerDescription":"Zeigt die Abklingzeiten der Gruppenmitglieder, um die Koordination im Kampf zu vereinfachen.", 
  "WeakauraHeader":"Bietet individualisierbare, visuelle und akustische Hinweise zur Verbesserung der Spielerperformance",
  "SendMessage":"Senden",
  "ContactMe":"Bleiben Sie in Kontakt",
  "ContactMeDiscord": "Über Discord kontaktieren",
  "Contact": "Kontakt",
  "TotheTop": "Zurück zum Anfang",
  "AnsweredComments": "Beantwortete Kommentare",
  "Favorites": "Favoriten",
  "Installs": "Installationen",
  "About": "Über mich",
  "LearnMore": "Erfahren Sie mehr",
  "MyWoWAddons": "Meine WoW Addons",
  "Additionals": "Vertiefungsfächer",
  "AdditionalDescription": "Zusätzlich zu den Pflichtkursen im Rahmen meines Studiums belegte ich folgende Vertiefungsfächer.",
  "VisualDataAnalysis": "Visual Data Analysis",
  "VisualDataAnalysisDescription": "Kurs konzentrierte sich auf die Visualisierung von Daten und die effektive Kommunikation von Informationen durch den Einsatz visueller Darstellungen. Die Grundlagen der Datenvisualisierung, einschließlich des Einsatzes von Farbe, Typografie und Layout wurden vermittelt. Darüber hinaus wurden verschiedene Tools für die Datenvisualisierung in R behandelt, darunter ggplot und plotly. Das Git-Repository des so erstellten Projekts finden Sie unter <a href='https://github.com/Jodsderechte/VisualDataAnalysis_VideoGameSales'>diesem Link</a> sowie eine Online-einsehbare Version <a href='https://jods.me/VisualDataAnalysis_VideoGameSales/VDAProjekt.html'> hier </a>.",
  "ConcurrencyProgramming": "Nebenläufige Programmierung",
  "ConcurrencyProgrammingDescription": "Zertifikat: Teilnehmende kennen die Bedeutung und wichtigsten Konzepte der nebenläufigen Programmierung. Sie erlernten die unterschiedlichen Synchronisierungsarten und deren Verwendung bei Algorithmen und den Entwurf von Datenstrukturen. Die wichtigsten Entwurfsmuster für Nebenläufigkeit sind bekannt - einfache Abschätzungen für Laufzeitverhalten können durchgeführt und einfache Algorithmen und Datenstrukturen umgesetzt werden. Die Teilnehmenden kennen die wichtigsten Software-Pakete, die in der Praxis eingesetzt werden, und können mit diesen Werkzeugen eigene Anwendungen erstellen.",
  "AppDevelopment": "Einführung in die App-Enwicklung",
  "AppDevelopmentDescription": "Beschreibung: Ziel der Veranstaltung ist es, Studierenden die Grundlagen in der Entwicklung von mobilen Applikationen näher zu bringen. Durch die Teilnahme an den Veranstaltungen sind die Studierenden in der Lage, eigenständig einfache Applikationen für Smartphones zu realisieren. Sie verstehen die Architektur und haben Hintergrundwissen über das Betriebssystem Android. Sie kennen und verstehen Methoden und Konzepte zur Entwicklung von Apps für Android und können diese auch anwenden. Sie beherrschen verschiedene Entwicklungswerkzeuge. Die Auszeichnungssprache XML ist ihnen grundlegend bekannt. Das Git-Repository des Finalen Projekts finden Sie: <a href='https://github.com/Jodsderechte/EAE_APP_BOOKSHELF'>hier</a>.",
  "BlockChainDescription": "Inhalt: Teilnehmende verstehen die Prinzipien von Bitcoin und Blockchain, erlernten die mathematischen Modelle, Protokolle und Algorithmen. Sie sind vertraut mit Kryptowährungen, wie Bitcoin und Ethereum, verstehen, wie die Blockchain als Distributed Ledger funktioniert, und begreifen die Prinzipien und Signifikanz dezentralisierter Konsensus- Protokolle, um zu entscheiden, wann diese Technologien optimal eingesetzt werden können. Teilnehmende erforschten die Ökonomie der Kryptowährungen und lernten Preismodelle, Börsen und Wallets kennen. Sie kennen die entsprechenden White Papers, technischen Artikel und die Spezifikationen der Protokolle, um diese entsprechend zu verstehen und einzusetzen. Weiter sind sie in der Lage, Anwendungsszenarien, Investmentpraktiken und Einsatzgebiete in unterschiedlichen Industrien zu identifizieren."
}
