{
  "DungeonAuraDescription":"Dungeon WeakAuras bieten während Dungeon-Begegnungen visuelle und auditive Hinweise, um das Bewusstsein der Spielenden für Mechaniken zu verbessern. Sie erstellen anpassbare Warnungen wie Symbole, Animationen und Geräusche, die Spielende vor bestimmten Boss-Fähigkeiten oder gefährlichen Situationen warnen. Diese Hinweise helfen Spielenden, schnell zu reagieren und bessere Entscheidungen zu treffen, was letztendlich ihre Leistung verbessert und zu erfolgreicheren Dungeon-Läufen beiträgt.",
  "ProgrammingLanguages":"Programmiersprachen",
  "ProgrammingLanguagesDescription":"Neben dem Studium,  das die Sprachen Java, C, C++, R JavaScript vermittelte, habe ich autodidaktisch Lua erlernt und in mehreren Projekten angewendet.",
  "GitDescription":"Täglich nutze ich GitHub als Hauptplattform zur Verwaltung und Freigabe meiner Projekte. Näheres:  <a href='https://github.com/Jodsderechte' target='_blank'>Auf meinem GitHub-Profil</a>",
  "UnrealEngine": "Für private Projekte nutze ich Unreal Engine. <br> Beispielhaft: <ul> <li> <a href='https://store.epicgames.com/en-US/p/ark--modkit'> die modifizierte Version von Unreal 5 (bzw 4.5.1) </a> für meine <a href='#ArkMod'> ARK Survival Ascended MODs</a> </li> <li> Unreal 5.1 für ein <a href='https://github.com/Jods-GH/Ateria'target='_blank'>eigenentwickeltes Survival-Spiel</a> </li> <li> Unreal 5.2 für ein Fantasy-Extraction MMO namens <a href='https://github.com/Jodsderechte/Ateria'target='_blank'>Ateria</a> </li> <li> Einen Unreal Blueprint Basics Workshop im Rahmen des Master Informatik <a href='https://florian-reichle.de/SocialSkills_UnrealEngine/WebSource/Project.html'target='_blank'>hier</a> </li></ul>",
  "Unity": "Nutzung von Unity bei einem noch nicht veröffentlichten Fahrradsimulator für <a href='https://www.nsoria.io/' target='_blank'>Nsoria</a> namens Nsoria/Shift.",
  "RaidAbilityTimelineDescription":"Verwandelt die Timer der Boss Mod-Addons zur besseren Übersichtlichkeit in eine vertikale Zeitleiste.",
  "InterruptTrackerDescription":"Zeigt die Abklingzeiten der Gruppenmitglieder, um die Koordination im Kampf zu vereinfachen.", 
  "WeakauraHeader":"Bietet individualisierbare, visuelle und akustische Hinweise zur Verbesserung der Spielerperformance",
  "SendMessage":"Senden",
  "ContactMe":"Sie haben Fragen? Nutzen Sie das Kontaktformular",
  "Contact": "Kontakt",
  "TotheTop": "Zurück zum Anfang",
  "AnsweredComments": "Beantwortete Kommentare",
  "Favorites": "Favoriten",
  "Installs": "Installationen",
  "About": "Über mich",
  "LearnMore": "Erfahren Sie mehr",
  "MyWoWAddons": "Meine WoW Addons",
  "Additionals": "Vertiefungsfächer",
  "AdditionalDescription": "Zusätzlich zu den Pflichtkursen im Rahmen meines Studiums belegte ich folgende Vertiefungsfächer:",
  "VisualDataAnalysis": "Visual Data Analysis",
  "VisualDataAnalysisDescription": "Der Kurs konzentrierte sich auf die Visualisierung von Daten und die effektive Kommunikation von Informationen durch den Einsatz visueller Darstellungen. Die Grundlagen der Datenvisualisierung, einschließlich des Einsatzes von Farbe, Typografie und Layout wurden vermittelt. Darüber hinaus wurden verschiedene Tools für die Datenvisualisierung in der Programmiersprache R behandelt; darunter ggplot und plotly. Ergebnisse: <ul> <li> Das Git-Repository des so erstellten Projekts: <a href='https://github.com/Jodsderechte/VisualDataAnalysis_VideoGameSales'>hier</a> </li> <li>Eine Online-einsehbare Version <a href='https://florian-reichle.de/VisualDataAnalysis_VideoGameSales/VDAProjekt.html'>hier</a>. </li></ul>",
  "ConcurrencyProgramming": "Nebenläufige Programmierung",
  "ConcurrencyProgrammingDescription": "Zertifikat: \"Teilnehmende kennen die Bedeutung und wichtigsten Konzepte der nebenläufigen Programmierung. Sie erlernten die unterschiedlichen Synchronisierungsarten und deren Verwendung bei Algorithmen und den Entwurf von Datenstrukturen. Die wichtigsten Entwurfsmuster für Nebenläufigkeit sind bekannt - einfache Abschätzungen für Laufzeitverhalten können durchgeführt und einfache Algorithmen und Datenstrukturen umgesetzt werden. Die Teilnehmenden kennen die wichtigsten Software-Pakete, die in der Praxis eingesetzt werden, und können mit diesen Werkzeugen eigene Anwendungen erstellen.\"",
  "AppDevelopment": "Einführung in die App-Enwicklung",
  "AppDevelopmentDescription": "Beschreibung der Veranstaltung: \"Ziel ist es, Studierenden die Grundlagen in der Entwicklung von mobilen Applikationen näher zu bringen. Durch die Teilnahme an den Veranstaltungen sind die Studierenden in der Lage, eigenständig einfache Applikationen für Smartphones zu realisieren. Sie verstehen die Architektur und haben Hintergrundwissen über das Betriebssystem Android. Sie kennen und verstehen Methoden und Konzepte zur Entwicklung von Apps für Android und können diese auch anwenden. Sie beherrschen verschiedene Entwicklungswerkzeuge. Die Auszeichnungssprache XML ist ihnen grundlegend bekannt. Das Git-Repository des Finalen Projekts finden Sie: <a href='https://github.com/Jodsderechte/EAE_APP_BOOKSHELF'>hier</a>.\"",
  "BlockChain": "Blockchain und Kryptowährungen",
  "BlockChainDescription": "Beschreibung der Veranstaltung: \"Teilnehmende verstehen die Prinzipien von Bitcoin und Blockchain, erlernten die mathematischen Modelle, Protokolle und Algorithmen. Sie sind vertraut mit Kryptowährungen, wie Bitcoin und Ethereum, verstehen, wie die Blockchain als Distributed Ledger funktioniert, und begreifen die Prinzipien und Signifikanz dezentralisierter Konsensus- Protokolle, um zu entscheiden, wann diese Technologien optimal eingesetzt werden können. Teilnehmende erforschten die Ökonomie der Währungen und lernten Preismodelle, Börsen und Wallets kennen. Sie kennen die entsprechenden White Papers, technischen Artikel und die Spezifikationen der Protokolle, um diese entsprechend zu verstehen und einzusetzen. Weiter sind sie in der Lage, Anwendungsszenarien, Investmentpraktiken und Einsatzgebiete in unterschiedlichen Industrien zu identifizieren.\"",
  "SkillsDescription":"Während meines Studiums und in meiner Freizeit habe ich mich intensiv mit verschiedenen Programmiersprachen und anderen relevanten Themen im Bereich der Softwareentwicklung beschäftigt. So habe ich Kenntnisse in Sprachen wie Lua und Java, die es mir ermöglichen, diverse Algorithmen zu implementieren und Anwendungen mit unterschiedlichen Funktionalitäten zu entwickeln. Darüber hinaus habe ich HTML, CSS und JavaScript erlernt, um interaktive und visuell ansprechende Websites zu erstellen. <br> Zusätzlich habe ich mich mit grundlegenden Werkzeugen wie Git vertraut gemacht, um Versionskontrolle und gemeinsame Programmierung durchzuführen. Die dabei gemachten Erfahrungen haben mir die Bedeutung von Teamarbeit in Softwareprojekten und die Wichtigkeit eines gut organisierten und effizienten Codebestands verdeutlicht. Neben der Versionskontrolle nutze ich meine vertieften Kenntnisse in SQL zum Verständnis der Grundlagen von Datenbankdesign und -Verwaltung. Damit ist es mir möglich, dynamische Anwendungen zu entwickeln, die mit Datenbanken interagieren, um Informationen zu speichern und abzurufen. <br> Insgesamt hat mich meine Leidenschaft für die Programmierung dazu motiviert, mein Wissen in diesem Bereich kontinuierlich zu erweitern. Durch eine formale Ausbildung und eigenständiges Lernen habe ich mir eine solide Grundlage in verschiedenen Programmiersprachen und relevanten Werkzeugen geschaffen, die es mir ermöglichen, komplexe Softwareprojekte anzugehen und eigene Beiträge zu entwickeln. Eine Auswahl finden sie auf dieser Seite rechts.",
  "Skills":"Fähigkeiten",
  "KeyCompetences": "Kernkompetenzen",
  "WhoAmI": "Wer bin ich?"

}
