{
  "DungeonAuraDescription":"Dungeon WeakAuras offer visual and auditory cues during dungeon encounters to improve a player's awareness of mechanics. They provide customizable alerts like icons, animations, and sounds that warn players about specific boss abilities or dangerous situations. These cues help players react quickly and make better decisions, ultimately enhancing their performance and contributing to successful Mythic + dungeon runs.",
  "ProgrammingLanguages":"Programming Languages",
  "ProgrammingLanguagesDescription":"In addition to studying languages (Java, C, C++, JavaScript, R) at university, I took it upon myself to learn C# and Lua, which I applied in various projects outside of academia.",
  "GitDescription":"On a daily basis, I actively utilize GitHub as my primary platform for managing and sharing my projects. Feel free to explore my publicly accessible repositories by visiting <a href='https://github.com/Jodsderechte'target='_blank'>github</a>",
  "UnrealEngine": "I have employed Unreal Engine for several private and University projects, encompassing a variety of Versions.<br> A Couple of Examples: <ul> <li> <a href='https://store.epicgames.com/en-US/p/ark--modkit'> a Modified Version of Unreal 5 (aka 4.5.1) </a> for my <a href='#ArkMod'> ARK Survival Ascended MODs</a> </li> <li> Unreal 5.1 for a <a href='https://github.com/Jods-GH/Ateria'target='_blank'>selfmade Survival-Game</a> </li> <li> Unreal 5.2 for a Fantasy-Extraction MMO namend <a href='https://github.com/Jodsderechte/Ateria'target='_blank'>Ateria</a> </li> <li> And created a Workshop to teach the Basics of Unreal Blueprints during a course for my Master in Computerscience <a href='https://florian-reichle.de/SocialSkills_UnrealEngine/WebSource/Project.html'target='_blank'>in German</a> </li></ul>",
  "Unity":"I have also had previous experience working with Unity on an unreleased bicycle simulator project for <a href='https://www.nsoria.io/' target='_blank'>Nsoria</a> known as Nsoria/Shift.",
  "RaidAbilityTimelineDescription":"Turn your BossMod addon timers into a vertical stacked timeline, for those who prefer this display.",
  "InterruptTrackerDescription":"Displays the cooldowns of group members disruptive spells, ensuring timely interruptions in battle.",
  "WeakauraHeader":"Providing customizable visual and audio cues to enhance gameplay awareness and optimize performance.",
  "SendMessage":"Send message",
  "ContactMe":"Let's get in touch! Send me a message and I will get back to you as soon as possible.",
  "Contact": "Contact",
  "TotheTop": "To the top",
  "AnsweredComments": "Answered comments",
  "Favorites": "Favorites",
  "Installs": "Installs",
  "About": "About me",
  "LearnMore": "Learn more",
  "MyWoWAddons": "My World of Warcraft addons",
  "Additionals": "Additional courses",
  "AdditionalDescription": "In addition to the required lectures I also took the following courses.",
  "VisualDataAnalysis": "Visual Data Analysis",
  "VisualDataAnalysisDescription": "This course focused on the visualization of data, and how to effectively communicate information through the use of visual representations. The course covered the fundamentals of data visualization, including the use of color, typography, and layout. The course also covered the use of various tools for data visualization in R, including ggplot and plotly. Feel free to check the Git Repository of the <a href='https://github.com/Jodsderechte/VisualDataAnalysis_VideoGameSales'> resulting project </a> or read the german version <a href='https://florian-reichle.de/VisualDataAnalysis_VideoGameSales/VDAProjekt.html'> directly </a>.",
  "ConcurrencyProgramming": "Concurrency Programming",
  "ConcurrencyProgrammingDescription": "Course participants are acquainted with the relevance and most important concepts of concurrent programming. They are familiar with the different types of synchronization, in addition to their use in algorithms and their conception in data structures. The most important design archetypes for concurrency are well-known to the participants; they can carry out assessments of runtime performance and can implement simple algorithms and data structures. Thus, participants are acquainted with a variety of methods on how concepts are implemented in practice.",
  "AppDevelopment": "App Development",
  "AppDevelopmentDescription": "This course focused on the App-Development in the Android universe. The course covered the fundamentals of Android development, including the use of Android Studio, Java, and XML. The course also covered the use of various tools for Android development, including the Android SDK and the Android Emulator. Feel free to check the Git Repository of the <a href='https://github.com/Jodsderechte/EAE_APP_BOOKSHELF'> resulting Book Shelf App </a>.",
  "BlockChain": "Crypto Currency, Blockchain and Smart Contracts",  
  "BlockChainDescription": "Participants will understand the principles of Bitcoin and Blockchain, learn about mathematical and economic models, protocols, and algorithms. They are familiar with the cryptocurrencies including Bitcoin or Ethereum, understand how the Blockchain works as a distributed ledger, comprehend the principles and significance of decentralized consensus protocols and will be able to decide when to use these technologies. Participants will explore the economy of cryptocurrencies, and learn about prices, exchanges and wallets. They will identify applications and best investment practices as well as use cases in different industries.",
  "SkillsDescription":"During my studies and in my free time, I have delved into various programming languages and other relevant topics in the field of software development. I have gained proficiency in languages such as Lua and Java allowing me to implement diverse algorithms and develop applications with different functionalities. Additionally, I have explored web development, learning HTML, CSS, and JavaScript to create interactive and visually appealing websites. <br> <br> Moreover, I have familiarized myself with essential tools like Git, enabling version control and collaborative coding. This experience has taught me the importance of teamwork in software projects and the significance of maintaining a well-organized and efficient codebase. Alongside version control, I have also honed my skills in SQL, grasping the fundamentals of database design and management. Understanding SQL has been vital in building dynamic applications that interact with databases to store and retrieve information. <br> <br> Overall, my passion for programming has driven me to continuously expand my knowledge in the field. Through both formal education and self-directed learning, I have built a strong foundation in various programming languages and relevant tools, empowering me to tackle complex software projects and contribute effectively to the world of technology. A selection of these skills can be found on the right.",
  "Skills":"Skills",
  "KeyCompetences": "Key Competences",
  "WhoAmI": "Who am I?"
}
